## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 33 to add, 0 to change, 34 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                              NAME                                               |
|----------|-------------------------------------------------------------------------------------------------|
| delete   | `aws_s3_object.notify_slack_code`                                                               |
| recreate | `aws_cloudwatch_log_group.notify_slack`                                                         |
|          | `aws_cloudwatch_log_subscription_filter.forms_app_log_stream`                                   |
|          | `aws_cloudwatch_log_subscription_filter.forms_unhandled_error_steam`                            |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;audit_log&quot;]`                    |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;audit_logs_archiver&quot;]`          |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;dlq_consumer&quot;]`                 |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;nagware&quot;]`                      |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;reliability&quot;]`                  |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;response_archiver&quot;]`            |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;submission&quot;]`                   |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;template_archiver&quot;]`            |
|          | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;vault_data_integrity_check&quot;]`   |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;audit_log&quot;]`                  |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;audit_logs_archiver&quot;]`        |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;dlq_consumer&quot;]`               |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;nagware&quot;]`                    |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;reliability&quot;]`                |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;response_archiver&quot;]`          |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;submission&quot;]`                 |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;template_archiver&quot;]`          |
|          | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;vault_data_integrity_check&quot;]` |
|          | `aws_lambda_function.notify_slack`                                                              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_lambda`                                          |
|          | `aws_lambda_permission.notify_slack_critical`                                                   |
|          | `aws_lambda_permission.notify_slack_ok`                                                         |
|          | `aws_lambda_permission.notify_slack_ok_us_east`                                                 |
|          | `aws_lambda_permission.notify_slack_warning`                                                    |
|          | `aws_lambda_permission.notify_slack_warning_us_east`                                            |
|          | `aws_sns_topic_subscription.topic_critical`                                                     |
|          | `aws_sns_topic_subscription.topic_ok`                                                           |
|          | `aws_sns_topic_subscription.topic_ok_us_east`                                                   |
|          | `aws_sns_topic_subscription.topic_warning`                                                      |
|          | `aws_sns_topic_subscription.topic_warning_us_east`                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notify_slack must be replaced
-/+ resource "aws_cloudwatch_log_group" "notify_slack" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/NotifySlack" -> (known after apply)
      ~ id                = "/aws/lambda/NotifySlack" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/NotifySlack" -> "/aws/lambda/notify-slack" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.forms_app_log_stream must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "forms_app_log_stream" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-3008753258" -> (known after apply)
        name            = "forms_app_log_stream"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.forms_unhandled_error_steam must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "forms_unhandled_error_steam" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-3008753258" -> (known after apply)
        name            = "forms_unhandled_error_stream"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["audit_log"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-821307863" -> (known after apply)
        name            = "error_detection_in_audit_log_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["audit_logs_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2742612913" -> (known after apply)
        name            = "error_detection_in_audit_logs_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["dlq_consumer"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-125968559" -> (known after apply)
        name            = "error_detection_in_dlq_consumer_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["nagware"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2378547274" -> (known after apply)
        name            = "error_detection_in_nagware_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["reliability"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2677299195" -> (known after apply)
        name            = "error_detection_in_reliability_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["response_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-1985583210" -> (known after apply)
        name            = "error_detection_in_response_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["submission"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2956744385" -> (known after apply)
        name            = "error_detection_in_submission_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["template_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-4036201582" -> (known after apply)
        name            = "error_detection_in_template_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["vault_data_integrity_check"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-125604783" -> (known after apply)
        name            = "error_detection_in_vault_data_integrity_check_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["audit_log"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-821307863" -> (known after apply)
        name            = "timeout_detection_in_audit_log_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["audit_logs_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2742612913" -> (known after apply)
        name            = "timeout_detection_in_audit_logs_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["dlq_consumer"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-125968559" -> (known after apply)
        name            = "timeout_detection_in_dlq_consumer_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["nagware"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2378547274" -> (known after apply)
        name            = "timeout_detection_in_nagware_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["reliability"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2677299195" -> (known after apply)
        name            = "timeout_detection_in_reliability_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["response_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-1985583210" -> (known after apply)
        name            = "timeout_detection_in_response_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["submission"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-2956744385" -> (known after apply)
        name            = "timeout_detection_in_submission_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["template_archiver"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-4036201582" -> (known after apply)
        name            = "timeout_detection_in_template_archiver_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["vault_data_integrity_check"] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      ~ destination_arn = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      ~ id              = "cwlsf-125604783" -> (known after apply)
        name            = "timeout_detection_in_vault_data_integrity_check_lambda_logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.notify_slack must be replaced
-/+ resource "aws_lambda_function" "notify_slack" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" -> (known after apply)
      ~ function_name                  = "NotifySlack" -> "notify-slack" # forces replacement
      - handler                        = "notify_slack.handler" -> null
      ~ id                             = "NotifySlack" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack/invocations" -> (known after apply)
      ~ last_modified                  = "2024-03-12T18:32:06.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "notify_slack_code" -> null
      - s3_object_version              = "PyMgtr32ws4WaGmnW8_J5v3xgSYhPXsD" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "OsJd8gBcFfPfRrCQT1iq3mOwD/HVbtvStHmskpExTvk=" -> (known after apply)
      ~ source_code_size               = 26171 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "ENVIRONMENT"      = "Staging" -> "staging"
                # (2 unchanged elements hidden)
            }
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_lambda" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_critical must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_critical" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromSNSCriticalAlert" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_ok must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromSNSOkAlert" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_ok_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok_us_east" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromSNSOkAlertUSEast" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_warning must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_warning" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromSNSWarningAlert" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_warning_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_warning_us_east" {
      ~ function_name       = "NotifySlack" -> "notify-slack" # forces replacement
      ~ id                  = "AllowExecutionFromSNSWarningAlertUSEast" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.notify_slack_code will be destroyed
  # (because aws_s3_object.notify_slack_code is not in configuration)
  - resource "aws_s3_object" "notify_slack_code" {
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "191bd286d2772ca04f03d7dae44a010d" -> null
      - force_destroy          = false -> null
      - id                     = "notify_slack_code" -> null
      - key                    = "notify_slack_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/notify_slack_code.zip" -> null
      - source_hash            = "OsJd8gBcFfPfRrCQT1iq3mOwD/HVbtvStHmskpExTvk=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - version_id             = "PyMgtr32ws4WaGmnW8_J5v3xgSYhPXsD" -> null
    }

  # aws_sns_topic_subscription.topic_critical must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_critical" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-critical:5f8130a6-61be-4edc-b180-6c0101540e19" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-critical:5f8130a6-61be-4edc-b180-6c0101540e19" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-ok:c1c0c05d-e97a-4e36-8f70-53ba9c4632a3" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-ok:c1c0c05d-e97a-4e36-8f70-53ba9c4632a3" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-ok:8ca9bae3-64b7-44d5-8fcc-cd90b21bed8a" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-ok:8ca9bae3-64b7-44d5-8fcc-cd90b21bed8a" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-warning:da0c2d3a-a255-4183-a601-9f987465d5ac" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-warning:da0c2d3a-a255-4183-a601-9f987465d5ac" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-warning:bf69d914-f76b-4e6e-aee2-6588d5388c05" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlack" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-warning:bf69d914-f76b-4e6e-aee2-6588d5388c05" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 33 to add, 0 to change, 34 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.response_time_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.twoFa_verification_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_slack_lambda"]
WARN - plan.json -...
```

</details>
